import UIKit



// Semaphore 세마포어
// 여러 스레드에서 공유 자원 접근을 제어하기 위한 동기화 도구
// 동시 접근 수 제한이 필요한 상황에서 유용하게 사용
// 과도한 wait() 데디락 위험성이 있음.

let semaphore = DispatchSemaphore(value: 2)

for i in 1...5 {
    DispatchQueue.global().async {
        semaphore.wait()
        print("🔧 작업 시작: \(i)")
        sleep(2)
        print("✅ 작업 종료: \(i)")
        semaphore.signal()
    }
}


// 뮤텍스(Mutex) - 한번에 하나의 스레드만 임계 구역을에 접근하도록 보장하는 상호 배제 장치 공유 자원의 정합성을 보장하기 위한 가장 기초적이고 강력한 동기화 도구 입니다.

// 1. 스레드 A가 lock() 호출 -> 잠금 성공
// 2. 스레드 B가 lock() 호출 -> 스레드 A가 unlock() 하기 전까지 대기(block)
// 3. 스레드 A가 unlock() -> B가 lock 획득
// 이로 인해 race condition, data corruption을 방지 할 수 있다.

